Catalogs/упСхемыОплатыУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упСхемыОплатыУслуг</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчетОтсрочки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыУчетаОтсрочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭтапыОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упВариантыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упСпособыУчетаОтсрочки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСпособыУчетаОтсрочки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоКалендарнымДням</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРабочимДням</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упСхемыОплатыУслуг/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ)
			И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		 упУправленияЗаявками.ЗаполнитьЭтапыОплатыТЧСхемыПоУмолчанию(Объект.ЭтапыОплаты);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
&НаКлиенте
Процедура ЭтапыОплатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОплатыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УчетОтсрочкиПриИзменении(Элемент)
	ОбновитьВидимость();
	Если Объект.УчетОтсрочки = ПредопределенноеЗначение("Перечисление.упСпособыУчетаОтсрочки.ПоРабочимДням") Тогда
		Объект.ПроизводственныйКалендарь = ПодобратьПроизводственныйКалендарь();	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПодобратьПроизводственныйКалендарь()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПроизводственныеКалендари.Ссылка
	                      |ИЗ
	                      |	Справочник.ПроизводственныеКалендари КАК ПроизводственныеКалендари");
                     
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ПроизводственныеКалендари.ПустаяСсылка()
	КонецЕсли; 

КонецФункции // ПодобратьПроизводственныйКалендарь()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()
	Элементы.ПроизводственныйКалендарь.Видимость = (Объект.УчетОтсрочки = ПредопределенноеЗначение("Перечисление.упСпособыУчетаОтсрочки.ПоРабочимДням"));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Нет.
	
#КонецОбласти
